Infineon/PSoC6-101-Video-Projects/PSoC 6_101/RemoteControl.cydsn/Generated_Source/PSoC6/CapSense_SensingCSX_LL.h
/***************************************************************************//**
* \file CapSense_SensingCSX_LL.h
* \version 2.0
*
* \brief
*   This file provides the headers of APIs specific to CSX sensing implementation.
*
* \see CapSense v2.0 Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#if !defined(CapSense_SENSING_CSX_LL_H)
#define CapSense_SENSING_CSX_LL_H

#include "syslib/cy_syslib.h"
#include "CapSense_Structure.h"
#include "CapSense_Configuration.h"

#if (CapSense_CSX_EN == 1u)

/*******************************************************************************
* Function Prototypes
*******************************************************************************/
/**
* \cond SECTION_CYSENSE_LOW_LEVEL
* \addtogroup group_cysense_low_level
* \{
*/

void CapSense_CSXSetupWidget(uint32 widgetId);
void CapSense_CSXSetupWidgetExt(uint32 widgetId, uint32 sensorId);
void CapSense_CSXScan(void);
void CapSense_CSXScanExt(void);

#if (CapSense_CSX_IDAC_AUTOCAL_EN == CapSense_ENABLE)
    void CapSense_CSXCalibrateWidget(uint32 widgetId, uint16 target);
#endif /* (CapSense_CSX_IDAC_AUTOCAL_EN == CapSense_ENABLE) */

void CapSense_CSXConnectTx(CapSense_FLASH_IO_STRUCT const *txPtr);
void CapSense_CSXConnectRx(CapSense_FLASH_IO_STRUCT const *rxPtr);
void CapSense_CSXDisconnectTx(CapSense_FLASH_IO_STRUCT const *txPtr);
void CapSense_CSXDisconnectRx(CapSense_FLASH_IO_STRUCT const *rxPtr);

/** \}
* \endcond */

/*******************************************************************************
* Function Prototypes
*******************************************************************************/
/**
* \cond SECTION_CYSENSE_INTERNAL
* \addtogroup group_cysense_internal
* \{
*/

void CapSense_CSXInitialize(void);
void CapSense_CSXElectrodeCheck(void);
uint32 CapSense_SsCSXGetTxClkDivider(uint32 widgetId);

/** \}
* \endcond */

/* The interrupt handler of the CSX sensing module */
void CapSense_CSXScanISR(void);

/*******************************************************************************
* Global variables exposed by the module
*******************************************************************************/

/* The local variable used to store a scan period */
extern volatile uint16 CapSense_csxScanPeriod;

/* The local variable used to return raw count from post scan ISR */
extern volatile uint16 CapSense_csxRawCount;

/* The pointer to the function used to register a callback in ISR */
extern void (* CapSense_CSXPostScanApiPtr)(void);


/***************************************
* API Constants
***************************************/
#define CapSense_CSX_DEADBAND_CYCLES_NUMBER             (2u)

/* The definition of the time interval is long enough for charging a 100-nF capacitor */
#define CapSense_CSX_MAX_CHARGE_TIME_US                 (100u)
#define CapSense_CSX_AVG_CYCLES_PER_LOOP                (5u)
#define CapSense_CSX_PRECHARGE_WATCHDOG_CYCLES_NUM      (((CapSense_CPU_CLOCK_FREQ_MHZ) * \
                                                                 (CapSense_CSX_MAX_CHARGE_TIME_US)) / \
                                                                 (CapSense_CSX_AVG_CYCLES_PER_LOOP))

/*******************************************************************************
* Register Configuration
*******************************************************************************/

/*
 * +--------+---------------+--------------------------------------------+-------------------------------------------+
 * |        |               | BLOCK_OFF_AFTER_SCAN=TRUE                  | BLOCK_OFF_AFTER_SCAN=FALSE                |
 * +  BITS  +   FIELD       +--------------------------------------------+-------------------------------------------+
 * |        |               |              MODE                          |              MODE                         |
 * |--------|---------------|--------------------------------------------|-------------------------------------------|
 * |  0     | IREF_SEL      | Select Iref according to IrefSel parameter | Select Iref according to IrefSel parameter|
 * |  8:4   | FILTER_DELAY  | 0x02(2-SampleClk cycles)                   | 0x02(2-SampleClk cycles)                  |
 * |  11:10 | SHIELD_DELAY  | 0x00(Delay Line is OFF)                    | 0x00(Delay Line is OFF)                   |
 * |  12    | SENSE_EN      | 0x00(Disabled. All switches are open)      | 0x01(Enabled. Switches can be closed)     |
 * |  17    | FULL_WAVE     | 0x00(Half Wave Mode)                       | 0x00(Half Wave Mode)                      |
 * |  18    | MUTUAL_CAP    | 0x01(Mutual-cap mode)                      | 0x01(Mutual-cap mode)                     |
 * |  19    | CSX_DUAL_CNT  | 0x01(Use two counters)                     | 0x01(Use two counters)                    |
 * |  24    | DSI_COUNT_SEL | 0x00(CSD-Result on the DSI_COUNT bus)      | 0x00(CSD-Result on DSI_COUNT bus)         |
 * |  25    | DSI_SAMPLE_EN | 0x00(DSI_SAMPLE_IN is disabled)            | 0x00(DSI_SAMPLE_IN is disabled)           |
 * |  26    | SAMPLE_SYNC   | 0x00(Double sync is disabled)              | 0x00(Double sync is disabled)             |
 * |  27    | DSI_SENSE_EN  | 0x00(DSI_SENSE_IN is disabled)             | 0x00(DSI_SENSE_IN is disabled)            |
 * |  30    | LP_MODE       | 0x00(High power mode)                      | 0x00(High power mode)                     |
 * |  31    | ENABLE        | 0x00(Analog part is OFF)                   | 0x01(Analog part is ON)                   |
 * +--------+---------------+--------------------------------------------+-------------------------------------------+*/
#if(CapSense_DISABLE != CapSense_BLOCK_OFF_AFTER_SCAN_EN)
    #define CapSense_CONFIG_DEFAULT_EN_CFG              (0x00000000uL)
#else
    #define CapSense_CONFIG_DEFAULT_EN_CFG              (0x80001000uL)
#endif /* (CapSense_DISABLE != CapSense_BLOCK_OFF_AFTER_SCAN_EN) */

#if(CapSense_IREF_SRSS != CapSense_CSD_IREF_SOURCE)
    #define CapSense_CONFIG_DEFAULT_IREF_CFG            (0x00000001uL)
#else
    #define CapSense_CONFIG_DEFAULT_IREF_CFG            (0x00000000uL)
#endif /* (CapSense_IREF_SRSS != CapSense_CSD_IREF_SOURCE) */

#if(CapSense_DISABLE != CapSense_LP_MODE_EN)
    #define CapSense_CONFIG_DEFAULT_LP_MODE_CFG         (0x40000000uL)
#else
    #define CapSense_CONFIG_DEFAULT_LP_MODE_CFG         (0x00000000uL)
#endif /* (CapSense_DISABLE != CapSense_LP_MODE_EN) */

#define CapSense_CONFIG_DEFAULT_FILTER_DELAY_CFG        (0x00000020uL)
#define CapSense_CONFIG_DEFAULT_MUTUAL_CFG              (0x00040000uL)
#define CapSense_CONFIG_DEFAULT_DUAL_CNT_CFG            (0x00080000uL)


#define CapSense_DEFAULT_CSD_CONFIG_CFG                 (CapSense_CONFIG_DEFAULT_IREF_CFG |\
                                                                 CapSense_CONFIG_DEFAULT_FILTER_DELAY_CFG |\
                                                                 CapSense_CONFIG_DEFAULT_MUTUAL_CFG |\
                                                                 CapSense_CONFIG_DEFAULT_DUAL_CNT_CFG |\
                                                                 CapSense_CONFIG_DEFAULT_LP_MODE_CFG |\
                                                                 CapSense_CONFIG_DEFAULT_EN_CFG)


/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 1      | SAMPLE        | 0x01(Clear CSD End Of Scan interrupt)                                                  |
 * | 2      | INIT          | 0x01(Clear CSD End Of Coarse Init interrupt)                                           |
 * | 8      | ADC_RES       | 0x01(Clear ADC End Of Scan interrupt)                                                  |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CapSense_DEFAULT_CSD_INTR_CFG                   (CapSense_CSD_INTR_ALL_MSK)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 1      | SAMPLE        | 0x00(CSD End Of Scan interrupt is cleared)                                             |
 * | 2      | INIT          | 0x00(CSD End Of Coarse Init interrupt is cleared)                                      |
 * | 8      | ADC_RES       | 0x00(ADC End Of Scan interrupt is cleared)                                             |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CapSense_DEFAULT_CSD_INTR_SET_CFG               (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 1      | SAMPLE        | 0x01(CSD End Of Scan interrupt is masked)                                              |
 * | 2      | INIT          | 0x00(CSD End Of Coarse Init interrupt is cleared)                                       |
 * | 8      | ADC_RES       | 0x00(ADC End Of Scan interrupt is cleared)                                              |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CapSense_DEFAULT_CSD_INTR_MASK_CFG              (CapSense_CSD_INTR_MASK_SAMPLE_MSK)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * |  0     |  HSCMP_EN     | 0x00(High Speed comparator is disabled)                                                |
 * |  4     |  HSCMP_INVERT | 0x00(High Speed comparator output is not inverted)                                     |
 * |  31    |  AZ_EN        | 0x00(Auto-Zero is disabled)                                                            |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CapSense_DEFAULT_CSD_HSCMP_CFG                  (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * |  1:0   | PWR_MODE      | 0x00(Amux buffer is disabled)                                                          |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CapSense_DEFAULT_CSD_AMBUF_CFG                  (0x00000000uL)

