Infineon/PSoC6-101-Video-Projects/PSoC 6_101/RemoteControl.cydsn/Generated_Source/PSoC6/CapSense_SensingCSX_LL.h
/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 4      | SW_F2PT       | 0x00(F2PT switch is statically closed)                                                 |
 * | 10:8   | SW_F2MA       | 0x00(F2MA switch is statically closed)                                                 |
 * | 14:12  | SW_F2CA       | 0x00(F2CA switch is statically olosed)                                                 |
 * | 18:16  | SW_F2CB       | 0x00(F2CB switch is statically open)                                                   |
 * | 20     | SW_C2CC       | 0x00(C2CC switch is statically open)                                                   |
 * | 24     | SW_C2CD       | 0x00(C2CD switch is statically open)                                                   |
 * | 28     | SW_C2F2       | 0x00(C2F2 switch is statically open)                                                   |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CapSense_PRECHARGE_CSD_SW_FW_TANK_SEL_CFG       (0x00001110uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 0      | START         | 0x01(STARTED)                                                                          |
 * | 1      | SEQ_MODE      | 0x01(INIT_COARSE)                                                                      |
 * | 3      | ABORT         | 0x00(RESET_TO_IDLE_STATE)                                                              |
 * | 4      | DSI_START_EN  | 0x00(DISABLE_CONTROL_BY_DSI)                                                           |
 * | 8      | AZ0_SKIP      | 0x01(SKIP_AZ0)                                                                         |
 * | 9      | AZ1_SKIP      | 0x01(SKIP_AZ1)                                                                         |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CapSense_PRECHARGE_CSD_SEQ_START_CFG            (0x00000303uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * +--------+---------------+----------------------------------------------------------------------------------------+
 * | 1:0    | RES_HCAV      | 0x00(Configure HCAV according to CsxScanShieldSwitchRes parameter)                     |
 * | 3:2    | RES_HCAG      | 0x00(Configure HCAG according to CsxScanShieldSwitchRes parameter)                     |
 * | 5:4    | RES_HCBV      | 0x00(Configure HCBV according to CsxScanShieldSwitchRes parameter)                     |
 * | 7:6    | RES_HCBG      | 0x00(Configure HCBG according to CsxScanShieldSwitchRes parameter)                     |
 * | 17:16  | RES_F1PM      | 0x00(Configure F1PM according to CsxScanSwitchRes parameter)                           |
 * | 19:18  | RES_F2PT      | 0x00(Configure 2PT according to CsxScanSwitchRes parameter)                            |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CapSense_SCAN_CSD_SW_RES_CFG                    ((CapSense_CSX_SCAN_SHIELD_SWITCH_RES << CSD_SW_RES_RES_HCAV_Pos) |\
                                                                 (CapSense_CSX_SCAN_SHIELD_SWITCH_RES << CSD_SW_RES_RES_HCAG_Pos) |\
                                                                 (CapSense_CSX_SCAN_SHIELD_SWITCH_RES << CSD_SW_RES_RES_HCBV_Pos) |\
                                                                 (CapSense_CSX_SCAN_SHIELD_SWITCH_RES << CSD_SW_RES_RES_HCBG_Pos) |\
                                                                 (CapSense_CSX_SCAN_SWITCH_RES << CSD_SW_RES_RES_F1PM_Pos) |\
                                                                 (CapSense_CSX_SCAN_SWITCH_RES << CSD_SW_RES_RES_F2PT_Pos))

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 0      | SW_F1PM       | 0x01(F1PM switch is statically closed)                                                 |
 * | 10:8   | SW_F1MA       | 0x03(F1MA switch is controlled by Phi2 of the SenseClk signal)                         |
 * | 18:16  | SW_F1CA       | 0x03(F1CA switch is controlled by Phi2 of the SenseClk signal)                         |
 * | 20     | SW_C1CC       | 0x00(C1CC switch is statically open)                                                   |
 * | 24     | SW_C1CD       | 0x00(C1CD switch is statically open)                                                   |
 * | 28     | SW_C1F1       | 0x00(C1F1 switch is statically open)                                                   |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CapSense_SCAN_CSD_SW_FW_MOD_SEL_CFG             (0x00030301uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 4      | SW_F2PT       | 0x01(F2PT switch is statically closed)                                                 |
 * | 10:8   | SW_F2MA       | 0x02(F2MA switch is controlled by Phi1 of the SenseClk signal)                         |
 * | 14:12  | SW_F2CA       | 0x02(F2CA switch is controlled by Phi1 of the SenseClk signal)                         |
 * | 18:16  | SW_F2CB       | 0x00(F2CB switch is statically open)                                                   |
 * | 20     | SW_C2CC       | 0x00(C2CC switch is statically open)                                                   |
 * | 24     | SW_C2CD       | 0x00(C2CD switch is statically open)                                                   |
 * | 28     | SW_C2F2       | 0x00(C2F2 switch is statically open)                                                   |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CapSense_SCAN_CSD_SW_FW_TANK_SEL_CFG            (0x00002210uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 3:0    | TX_OUT        | 0x00(The TX_OUT signal is controlled by SenseClk signal)                               |
 * | 7:4    | TX_OUT_EN     | 0x00(The TX_OUT_EN signal is set to the static "1")                                    |
 * | 15:12  | TX_AMUXB_EN   | 0x00(The TX_AMUXB_EN signal is set to the static "0")                                  |
 * | 19:16  | TX_N_OUT      | 0x00(The TX_N_OUT signal is set to the static "0")                                     |
 * | 23:20  | TX_N_OUT_EN   | 0x00(The TX_N_OUT_EN signal is set to the static "0")                                  |
 * | 27:24  | TX_N_AMUXA_EN | 0x00(The TX_N_AMUXA_EN signal is set to the static "0")                                |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define CapSense_SCAN_CSD_SW_IO_SEL_CFG                 (0x0000001FuL)

/* +--------+---------------+--------------------------------------------+-------------------------------------------+
 * |        |               |      AUTO_ZERO_EN=TRUE                     |     AUTO_ZERO_EN=TRUE                     |
 * +  BITS  +   FIELD       +--------------------------------------------+-------------------------------------------+
 * |        |               |              MODE                          |             MODE                          |
 * |--------|---------------|--------------------------------------------|-------------------------------------------|
 * |  0     | START         | 0x01(CSD sequencer is stopped)             | 0x01(CSD sequencer is stopped)            |
 * |  1     | SEQ_MODE      | 0x00(Regular CSD scan mode is used)        | 0x00(Regular CSD scan mode is used)       |
 * |  3     | ABORT         | 0x00(Do not reset CSD sequencer)           | 0x00(Do not reset CSD sequencer)          |
 * |  4     | DSI_START_EN  | 0x00(Disable control by DSI)               | 0x00(Disable control by DSI)              |
 * |  8     | AZ0_SKIP      | 0x00(Do not skip AZ0 state)                | 0x01(Skip AZ0 state)                      |
 * |  9     | AZ1_SKIP      | 0x00(Do not skip AZ1 state)                | 0x01(Skip AZ1 state)                      |
 * +--------+---------------+--------------------------------------------+-------------------------------------------+*/
#if(0u != CapSense_CSX_AUTO_ZERO_EN)
    #define CapSense_SCAN_CSD_SEQ_START_CFG             (0x00000001uL)
#else
    #define CapSense_SCAN_CSD_SEQ_START_CFG             (0x00000301uL)
#endif /* (0u != CapSense_CSX_AUTO_ZERO_EN) */

#endif  /* End of CapSense_CSX_EN */
#endif  /* End of CapSense_SENSING_CSD_LL_H */


/* [] END OF FILE */
